Repository: caslav-ilic/Divergloss
Catalog: dgproc/po/*.po
Languages: sr

# error message
source: XML parsing failed: %(msg)s
sr: неуспех рашчлањивања ИксМЛ-а: %(msg)s

# error message
source: DTD validation failed: %(msg)s
sr: неуспех овере ДТД-ом: %(msg)s

# error message
source: duplicate ID '%(id)s'
sr: дупликатски ИД ‘%(id)s’

# error message
source: attribute '%(att)s' states a non-language key: %(key)s
sr: атрибут ‘%(att)s’ наводи нејезички кључ: %(key)s

# error message
source: attribute '%(att)s' states non-environment keys: %(keys)s
sr: атрибут ‘%(att)s’ наводи неокружењске кључеве: %(keys)s

# error message
source: attribute '%(att)s' states a non-editor key: %(key)s
sr: атрибут ‘%(att)s’ наводи неуреднички кључ: %(key)s

# error message
source: attribute '%(att)s' states a non-source key: %(key)s
sr: атрибут ‘%(att)s’ наводи неизворни кључ: %(key)s

# error message
source: attribute '%(att)s' states a non-grammar key: %(key)s
sr: атрибут ‘%(att)s’ наводи неграматички кључ: %(key)s

# error message
source: attribute '%(att)s' states a non-root key: %(key)s
sr: атрибут ‘%(att)s’ наводи некорени кључ: %(key)s

# error message
source: attribute '%(att)s' states a non-concept key: %(key)s
sr: атрибут ‘%(att)s’ наводи непојмовни кључ: %(key)s

# error message
source: attribute '%(att)s' states non-topic keys: %(keys)s
sr: атрибут ‘%(att)s’ наводи нетематске кључеве: %(keys)s

# error message
source: attribute '%(att)s' states non-level keys: %(keys)s
sr: атрибут ‘%(att)s’ наводи ненивоске кључеве: %(keys)s

# error message
source: attribute '%(att)s' states non-concept keys: %(keys)s
sr: атрибут ‘%(att)s’ наводи непојмовне кључеве: %(keys)s

# error message
source: post-DTD validation failed: %(msg)s
sr: неуспех овере након ДТД-а: %(msg)s

# an unknown file
source: <unknown>
sr: <непозната>

# warning message
source: unterminated embedded selector '%(esel)s'
sr: неокончани угњеждени изборник ‘%(esel)s’

# warning message
source: segment '%(eseg)s' in embedded selector '%(esel)s' repeats environments: %(envs)s
sr: сегмент ‘%(eseg)s’ угњежденог изборника ‘%(esel)s’ понавља окружења: %(envs)s

# warning message
source: no resolution for expected environment '%(env)s' in embedded selector '%(esel)s'
sr: нема разрешења за очекивано окружење ‘%(env)s’ у угњежденом изборнику ‘%(esel)s’

# command usage
source: %(cmd)s [OPTIONS] [SIEVES] DGFILE
sr: %(cmd)s [ОПЦИЈЕ] [СИТА] ДГТЕКА

# command description
source: Query a Divergloss XML document and build various outputs. Also fully validates the document, past what the DTD only can do.
sr: Испитује диверглоски ИксМЛ документ и гради разне излазе. Такође потпуно оверава документ, изнад могућег само ДТД-ом.

# command version
source: %(cmd)s experimental Copyright 2008, Chusslove Illich <caslav.ilic@gmx.net>
sr: %(cmd)s експериментална © 2008, Часлав Илић <caslav.ilic@gmx.net>

# description of cmdline option
source: do not check the glossary for validity
sr: не оверавај исправност појмовника

# placeholder for value to cmdline option
source: PARSPEC
sr: ПАРСПЕЦ

# description of cmdline option
source: specify parameter to sieves
sr: наведи параметар за сита

# description of cmdline option
source: list available sieves and exit
sr: наброји доступна сита и изађи

# description of cmdline option
source: display help on sieves and exit
sr: прикажи помоћ за сита и изађи

# error in command line
source: too many free arguments
sr: превише слободних аргумената

# header to listing
source: Available sieves:
sr: Расположива сита:

# error in command line
source: no file given
sr: није задата датотека

# error in command line
source: file '%(file)s' does not exists
sr: датотека ‘%(file)s’ не постоји

# header to listing
source: Help on sieves:
sr: Помоћ за сита:

# message
source: No sieves specified to provide help on.
sr: Нема ниједног сита за које би се дала помоћ.

# subcommand description
source: Create HTML pages out of the glossary.
sr: Градња ХТМЛ страна према појмовнику.

# placeholder for parameter value
source: LANGKEY
sr: ЈЕЗКЉУЧ

# subcommand option description
source: Pivotal language for the view. The glossary default language is used if not given.
sr: Осовински језик за поглед. Ако није дат, користи се подразумевани језик појмовника.

# placeholder for parameter value
source: ENVKEY
sr: ОКРКЉУЧ

# subcommand option description
source: Pivotal environment for the view. If not given, there is no pivotal environment.
sr: Осовинско окружење за поглед. Ако није дато, нема осовинског окружења.

# placeholder for parameter value
source: BASENAME
sr: БАЗНОИМЕ

# subcommand option description
source: Base name for writing generated HTML to disk, used to derive file names by chunking policy. If not given, glossary ID is used.
sr: Базно име за испис произведеног ХТМЛ-а на диск, за извођење имена датотека при комадању. Ако није дато, узима се ИД појмовника.

# placeholder for parameter value
source: POLICY
sr: СМЕРНИЦА

# subcommand option description
source: How to subdivide the glossary into chunks. The possible policies are: %(alpha)s: concepts alphabetically split by pages, a separate title page with main glossary data, and another page for rest of the global data. %(chlim)s: similar to '%(alpha)s', but concept pages are split based on the limit of maximum characters per page (see '%(maxch)s' option). %(none)s: no chunking, all glossary content on a single page.
sr: Како изделити појмовник на комаде. Могуће смернице су: %(alpha)s: појмови алфабетски подељени по странама, засебна насловна страна с главним подацима о појмовнику, и још једна страна са осталим глобалним подацима. %(chlim)s: слично као ‘%(alpha)s’, али се стране појмова деле на основу ограничења највећег броја знакова по страни (в. опцију ‘%(maxch)s’). %(none)s: без комадања, сав садржај појмовника на једној страни.

# placeholder for parameter value
source: NCHAR
sr: ЗНАКОВА

# subcommand option description
source: The character limit when using the '%(chlim)s' chunking policy.
sr: Ограничење броја знакова при смерници комадања ‘%(chlim)s’.

# error message
source: chunking by character count not implemented yet
sr: комадање по броју знакова још увек није изведено

# error message
source: language '%(lang)s' not present in the glossary
sr: језик ‘%(lang)s’ није присутан у појмовнику

# error message
source: environment '%(env)s' not defined by the glossary
sr: окружење ‘%(env)s’ није дефинисано појмовником

# subcommand description
source: Create a PO file out of the glossary.
sr: Градња ПО датотеке према појмовнику.

# subcommand option description
source: Original language from the PO point of view.
sr: Изворни језик с тачке гледишта ПО-а.

# subcommand option description
source: Target language from the PO point of view.
sr: Циљни језик с тачке гледишта ПО-а.

# subcommand option description
source: Environment for which the PO file is produced.
sr: Окружење за које се производи ПО датотека.

# placeholder for parameter value
source: FILE
sr: ДАТОТЕКА

# subcommand option description
source: File to output the PO content (defaults to stdout).
sr: Датотека за испис ПО садржаја (подразумевано стдиз.)

# subcommand option description
source: Show descriptions only on conflicts, for concepts having terms also used to name other concepts.
sr: Дај описе само при сукобима, за појмове са изразима који именују и још неке друге појмове.

# error message
source: origin language '%(lang)s' not present in the glossary
sr: изворни језик ‘%(lang)s’ није присутан у појмовнику

# error message
source: target language '%(lang)s' not present in the glossary
sr: циљни језик ‘%(lang)s’ није присутан у појмовнику

# message comment in the PO view: short label preceeding a concept description
source: desc:
sr: опис:

# message comment in the PO view: short label preceeding a declination
source: decl:
sr: декл:

# warning message
source: no concepts found for PO view that have terms in both the requested origin and target language
sr: нема ниједног концепта за ПО поглед који би имао изразе и за тражени изворни и циљни језик

# header comment in the PO view (title)
source: PO view of a Divergloss glossary: %(title)s
sr: ПО поглед на диверглоски појмовник: %(title)s

# header comment in the PO view (subtitle)
source: languages: %(ol)s->%(tl)s, environment: %(env)s
sr: језици: %(ol)s→%(tl)s, окружење: %(env)s

# header comment in the PO view (warning to user)
source: ===== AUTOGENERATED FILE, DO NOT EDIT =====
sr: ===== САМОПРОИЗВЕДЕНА ДАТОТЕКА, НЕ УРЕЂИВАТИ =====

# subcommand description
source: Transform Serbian Cyrillic text in the glossary into Serbian Latin.
sr: Претварање српског ћириличног текста кроз појмовник у латинични.

# subcommand description
source: Simple text view as a demonstration of writing views.
sr: Једноставни текстуални поглед као пример писања погледа.

# subcommand option description
source: Pivotal environment for the view. The glossary default environment is used if not given.
sr: Осовинско окружење за поглед. Ако није дато, користи се подразумевано окружење из појмовника.

# subcommand option description
source: File to output the text into (defaults to stdout).
sr: Датотека за испис текста (подразумевано стдиз).

# placeholder for parameter value
source: COLUMN
sr: КОЛОНА

# subcommand option description
source: Wrap text after this column.
sr: Прелом редова после ове колоне.

# error message
source: language '%(lang)s' does not exits in the glossary
sr: језик ‘%(lang)s’ не постоји у појмовнику

# error message
source: environment '%(env)s' does not exits in the glossary
sr: окружење ‘%(env)s’ не постоји у појмовнику

# error in command line
source: unknown subcommand requested in category '%(cat)s': %(cmd)s
sr: затражена непозната поднаредба у категорији ‘%(cat)s’: %(cmd)s

# error in command line
source: unknown subcommand requested: %(cmd)s
sr: затражена непозната поднаредба: %(cmd)s

# error message
source: requested names of subcommands from an unknown category
sr: захтевана имена поднаредби из непознате категорије

# error message
source: requested unknown category of subcommands
sr: затражена непозната категорија поднаредби

# error message
source: trying to add subcommand '%(cmd)s' once again
sr: покушај поновног додавања поднаредбе ‘%(cmd)s’

# error message
source: trying to get a view for an unknown subcommand '%(cmd)s'
sr: покушај добављања погледа за непознату наредбу ‘%(cmd)s’

# error message
source: trying to get help for an unknown subcommand '%(cmd)s'
sr: покушај добављања помоћи за непознату поднаредбу ‘%(cmd)s’

# error in command line (subcommand)
source: unregistered subcommand '%(cmd)s' issued
sr: издата нерегистрована поднаредба ‘%(cmd)s’

# error in command line (subcommand)
source: parameter '%(par)s' repeated more than once
sr: параметар ‘%(par)s’ поновљен више од једном

# error in command line (subcommand)
source: parameter '%(par)s' is a flag, no value expected
sr: параметар ‘%(par)s’ је заставица, не очекује се вредност

# error in command line (subcommand)
source: cannot convert value '%(val)s' to parameter '%(par)s' into expected type '%(type)s'
sr: вредност ‘%(val)s’ параметра ‘%(par)s’ не може се претворити у очекивани тип ‘%(type)s’

# error in command line (subcommand)
source: cannot convert value '%(val)s' to parameter '%(par)s' into list of elements of expected type '%(type)s'
sr: вредност ‘%(val)s’ параметра ‘%(par)s’ не може се претворити у листу елемената очекиваног типа ‘%(type)s’

# error in command line (subcommand)
source: value '%(val)s' to parameter '%(par)s' not from the admissible set: %(avals)s
sr: вредност ‘%(val)s’ параметра ‘%(par)s’ није из допуштеног скупа: %(avals)s

# error in command line (subcommand)
source: parameter '%(par)s' not expected in any of the issued subcommands
sr: ниједна од издатих поднаредби не очекује параметар ‘%(par)s’

# error in command line (subcommand)
source: mandatory parameter '%(par)s' to subcommand '%(cmd)s' not given
sr: није наведен обавезни параметар ‘%(par)s’ за поднаредбу ‘%(cmd)s’

# the name for an empty string as parameter value
source: <empty>
sr: <празно>

# error message
source: trying to add suboption '%(opt)s' to subcommand '%(cmd)s' with default value '%(val)s' different from its stated type '%(type)s'
sr: покушај додавања поднаредби '%(cmd)s' подопције ‘%(opt)s’ подразумеване вредности ‘%(val)s’ различитог типа од задатог ‘%(type)s’

# error message
source: trying to add suboption '%(opt)s' to subcommand '%(cmd)s' with default value '%(val)s' not from the admissible set: %(avals)s
sr: покушај додавања поднаредби '%(cmd)s' подопције ‘%(opt)s’ подразумеване вредности ‘%(val)s’ ван допуштеног скупа: %(avals)s

# error message
source: trying to add suboption '%(opt)s' to subcommand '%(cmd)s' once again
sr: покушај поновног додавања подопције ‘%(opt)s’ поднаредби ‘%(cmd)s’

# error message
source: suboption '%(opt)s' to subcommand '%(cmd)s' stated to be list-valued, but the default value is not given as a list
sr: вредност подопције ‘%(opt)s’ у поднаредби '%(cmd)s' задата је као листа, али подразумевана вредност није листа

# error message
source: trying to add suboption '%(opt)s' to subcommand '%(cmd)s' with a type different from other subcommands in the category '%(cat)s'
sr: покушај додавања поднаредби ‘%(cmd)s’ подопције ‘%(opt)s’ с типом различитим од других поднаредби у категорији ‘%(cat)s’

# error message
source: trying to add suboption '%(opt)s' to subcommand '%(cmd)s' with a type different from other subcommands
sr: покушај додавања поднаредби ‘%(cmd)s’ подопције ‘%(opt)s’ с типом различитим од других поднаредби

# error message
source: trying to add suboption '%(opt)s' to subcommand '%(cmd)s' with a list-indicator different from other subcommands in the category '%(cat)s'
sr: покушај додавања поднаредби ‘%(cmd)s’ подопције ‘%(opt)s’ с показатељем листе различитим од других поднаредби у категорији ‘%(cat)s’

# error message
source: trying to add suboption '%(opt)s' to subcommand '%(cmd)s' with a list-indicator different from other subcommands
sr: покушај додавања поднаредби ‘%(cmd)s’ подопције ‘%(opt)s’ с показатељем листе различитим од других поднаредби

source: [flag]
sr: [заставица]

# subcommand help: default name for the suboptions' parameter; do keep uppercase
source: ARG
sr: АРГ

source: [default %(arg)s=%(val)s]
sr: [подразумевано %(arg)s=%(val)s]

source: [%(arg)s is one of: %(avals)s]
sr: [%(arg)s може бити: %(avals)s]

# subcommand help: header
source: Mandatory parameters:
sr: Обавезни параметри:

# subcommand help: header
source: Optional parameters:
sr: Опциони параметри:

# error message
source: %(cmdname)s: error: %(msg)s
sr: %(cmdname)s: грешка: %(msg)s

# error message
source: %(cmdname)s: warning: %(msg)s
sr: %(cmdname)s: упозорење: %(msg)s
